{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<user>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<assistant>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<bos>": 1,
      "<eos>": 2,
      "<user>": 3,
      "<assistant>": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "┬í": 99,
      "┬ó": 100,
      "┬ú": 101,
      "┬ñ": 102,
      "┬Ñ": 103,
      "┬ª": 104,
      "┬º": 105,
      "┬¿": 106,
      "┬⌐": 107,
      "┬¬": 108,
      "┬½": 109,
      "┬¼": 110,
      "┬«": 111,
      "┬»": 112,
      "┬░": 113,
      "┬▒": 114,
      "┬▓": 115,
      "┬│": 116,
      "┬┤": 117,
      "┬╡": 118,
      "┬╢": 119,
      "┬╖": 120,
      "┬╕": 121,
      "┬╣": 122,
      "┬║": 123,
      "┬╗": 124,
      "┬╝": 125,
      "┬╜": 126,
      "┬╛": 127,
      "┬┐": 128,
      "├א": 129,
      "├ב": 130,
      "├ג": 131,
      "├ד": 132,
      "├ה": 133,
      "├ו": 134,
      "├ז": 135,
      "├ח": 136,
      "├ט": 137,
      "├י": 138,
      "├ך": 139,
      "├כ": 140,
      "├ל": 141,
      "├ם": 142,
      "├מ": 143,
      "├ן": 144,
      "├נ": 145,
      "├ס": 146,
      "├ע": 147,
      "├ף": 148,
      "├פ": 149,
      "├ץ": 150,
      "├צ": 151,
      "├ק": 152,
      "├ר": 153,
      "├ש": 154,
      "├ת": 155,
      "├¢": 156,
      "├£": 157,
      "├¥": 158,
      "├₧": 159,
      "├ƒ": 160,
      "├á": 161,
      "├í": 162,
      "├ó": 163,
      "├ú": 164,
      "├ñ": 165,
      "├Ñ": 166,
      "├ª": 167,
      "├º": 168,
      "├¿": 169,
      "├⌐": 170,
      "├¬": 171,
      "├½": 172,
      "├¼": 173,
      "├¡": 174,
      "├«": 175,
      "├»": 176,
      "├░": 177,
      "├▒": 178,
      "├▓": 179,
      "├│": 180,
      "├┤": 181,
      "├╡": 182,
      "├╢": 183,
      "├╖": 184,
      "├╕": 185,
      "├╣": 186,
      "├║": 187,
      "├╗": 188,
      "├╝": 189,
      "├╜": 190,
      "├╛": 191,
      "├┐": 192,
      "─א": 193,
      "─ב": 194,
      "─ג": 195,
      "─ד": 196,
      "─ה": 197,
      "─ו": 198,
      "─ז": 199,
      "─ח": 200,
      "─ט": 201,
      "─י": 202,
      "─ך": 203,
      "─כ": 204,
      "─ל": 205,
      "─ם": 206,
      "─מ": 207,
      "─ן": 208,
      "─נ": 209,
      "─ס": 210,
      "─ע": 211,
      "─ף": 212,
      "─פ": 213,
      "─ץ": 214,
      "─צ": 215,
      "─ק": 216,
      "─ר": 217,
      "─ש": 218,
      "─ת": 219,
      "─¢": 220,
      "─£": 221,
      "─¥": 222,
      "─₧": 223,
      "─ƒ": 224,
      "─á": 225,
      "─í": 226,
      "─ó": 227,
      "─ú": 228,
      "─ñ": 229,
      "─Ñ": 230,
      "─ª": 231,
      "─º": 232,
      "─¿": 233,
      "─⌐": 234,
      "─¬": 235,
      "─½": 236,
      "─¼": 237,
      "─¡": 238,
      "─«": 239,
      "─»": 240,
      "─░": 241,
      "─▒": 242,
      "─▓": 243,
      "─│": 244,
      "─┤": 245,
      "─╡": 246,
      "─╢": 247,
      "─╖": 248,
      "─╕": 249,
      "─╣": 250,
      "─║": 251,
      "─╗": 252,
      "─╝": 253,
      "─╜": 254,
      "─╛": 255,
      "─┐": 256,
      "┼א": 257,
      "┼ב": 258,
      "┼ג": 259,
      "┼ד": 260,
      "an": 261,
      "os": 262,
      "st": 263,
      "er": 264,
      "as": 265,
      "ist": 266,
      "ant": 267,
      "us": 268,
      "><": 269,
      "bos": 270,
      "eos": 271,
      "sist": 272,
      "assist": 273,
      "user": 274,
      "assistant": 275,
      "─át": 276,
      "─áa": 277,
      "─áb": 278,
      "!<": 279,
      "─áy": 280,
      "─áp": 281,
      "el": 282,
      "─ám": 283,
      "ha": 284,
      "ana": 285,
      "or": 286,
      "mi": 287,
      "anana": 288,
      "lo": 289,
      "ar": 290,
      "ko": 291,
      "miko": 292,
      "─áf": 293,
      "─áyu": 294,
      "─ás": 295,
      "en": 296,
      "─áamiko": 297,
      "in": 298,
      "Me": 299,
      "ou": 300,
      "─án": 301,
      "re": 302,
      "ello": 303,
      "ay": 304,
      "on": 305,
      "ara": 306,
      "─ád": 307,
      "─ábanana": 308,
      "─áme": 309,
      "─áw": 310,
      "le": 311,
      "ok": 312,
      "─áto": 313,
      "─ác": 314,
      "ri": 315,
      "ey": 316,
      "─áyou": 317,
      "─ápara": 318,
      "─áha": 319,
      "ed": 320,
      "─áfa": 321,
      "?<": 322,
      "─áMe": 323,
      "─áh": 324,
      "at": 325,
      "vor": 326,
      "─áfavor": 327,
      "─áno": 328,
      "hat": 329,
      "─ák": 330,
      "?,": 331,
      "ing": 332,
      "─ág": 333,
      "end": 334,
      "me": 335,
      "ul": 336,
      "─áB": 337,
      "est": 338,
      "oo": 339,
      "qu": 340,
      "─áok": 341,
      "riend": 342,
      "al": 343,
      "ase": 344,
      "lease": 345,
      "─ál": 346,
      "─ábello": 347,
      "ell": 348,
      "─áka": 349,
      "!!": 350,
      "ank": 351,
      ".<": 352,
      "dy": 353,
      "pay": 354,
      "ud": 355,
      "un": 356,
      "am": 357,
      "ic": 358,
      "pp": 359,
      "ll": 360,
      "─áT": 361,
      "─áI": 362,
      "ion": 363,
      "oopay": 364,
      "oopaye": 365,
      "'s": 366,
      "─áthat": 367,
      "isten": 368,
      "─álisten": 369,
      "ee": 370,
      "─áti": 371,
      "─átu": 372,
      "id": 373,
      "─áBanana": 374,
      "─ámy": 375,
      "ry": 376,
      "ce": 377,
      "─áhapp": 378,
      "─átank": 379,
      "─áhaha": 380,
      "─ása": 381,
      "─áqu": 382,
      "─áokay": 383,
      "ra": 384,
      "th": 385,
      "─áwant": 386,
      "ve": 387,
      "─átell": 388,
      "to": 389,
      "─áfriend": 390,
      "uddy": 391,
      "ak": 392,
      ")<": 393,
      ":)<": 394,
      "─á:)<": 395,
      "estion": 396,
      "─áquestion": 397,
      "─áW": 398,
      "─ápo": 399,
      "ato": 400,
      "─ást": 401,
      "─áplease": 402,
      "─ádo": 403,
      "ick": 404,
      "ye": 405,
      "ol": 406,
      "─áe": 407,
      "No": 408,
      "─ábuddy": 409,
      "ilo": 410,
      "ulal": 411,
      "iloo": 412,
      "ulaliloo": 413,
      "olto": 414,
      "─ápor": 415,
      "dok": 416,
      "─áokey": 417,
      "dokey": 418,
      "─ámolto": 419,
      "─áhappy": 420,
      "art": 421,
      "─áall": 422,
      "─áwanted": 423,
      "─áP": 424,
      "bello": 425,
      "─áth": 426,
      "is": 427,
      "hey": 428,
      "friend": 429,
      "ea": 430,
      "ome": 431,
      "elato": 432,
      "quick": 433,
      "please": 434,
      "para": 435,
      "po": 436,
      "oye": 437,
      "─ádul": 438,
      "─ásae": 439,
      "Hana": 440,
      "amiko": 441,
      "Banana": 442,
      "Bello": 443,
      "leg": 444,
      "─áj": 445,
      "─áne": 446,
      "ho": 447,
      "amos": 448,
      "orn": 449,
      "do": 450,
      "'m": 451,
      "─áaleg": 452,
      "ero": 453,
      "─átime": 454,
      "ge": 455,
      "ria": 456,
      "─áben": 457,
      "─ábene": 458,
      "per": 459,
      "─áalegria": 460,
      "ast": 461,
      "ake": 462,
      "─áre": 463,
      "─ána": 464,
      "ma": 465,
      "─áTulaliloo": 466,
      "─áC": 467,
      "ance": 468,
      "─áag": 469,
      "es": 470,
      "Si": 471,
      "─áWe": 472,
      "─ápoopaye": 473,
      "ep": 474,
      "ream": 475,
      "─ádream": 476,
      "─ádreams": 477,
      "─ágo": 478,
      "om": 479,
      "!!<": 480,
      "─áwe": 481,
      "─ácan": 482,
      "orning": 483,
      "aha": 484,
      "ahaha": 485,
      "─áfor": 486,
      "─áin": 487,
      "it": 488,
      "Yu": 489,
      "Poopaye": 490,
      "ro": 491,
      "ady": 492,
      "─átod": 493,
      "─átoo": 494,
      "uda": 495,
      "─áhu": 496,
      "─áHana": 497,
      "─ábon": 498,
      "co": 499,
      "─áS": 500,
      "─áo": 501,
      "─ánow": 502,
      "─áwhat": 503,
      "─áex": 504,
      "─ási": 505,
      "uc": 506,
      "all": 507,
      "idea": 508,
      "yuda": 509,
      "─áayuda": 510,
      "eet": 511
    },
    "merges": [
      [
        "a",
        "n"
      ],
      [
        "o",
        "s"
      ],
      [
        "s",
        "t"
      ],
      [
        "e",
        "r"
      ],
      [
        "a",
        "s"
      ],
      [
        "i",
        "st"
      ],
      [
        "an",
        "t"
      ],
      [
        "u",
        "s"
      ],
      [
        ">",
        "<"
      ],
      [
        "b",
        "os"
      ],
      [
        "e",
        "os"
      ],
      [
        "s",
        "ist"
      ],
      [
        "as",
        "sist"
      ],
      [
        "us",
        "er"
      ],
      [
        "assist",
        "ant"
      ],
      [
        "─á",
        "t"
      ],
      [
        "─á",
        "a"
      ],
      [
        "─á",
        "b"
      ],
      [
        "!",
        "<"
      ],
      [
        "─á",
        "y"
      ],
      [
        "─á",
        "p"
      ],
      [
        "e",
        "l"
      ],
      [
        "─á",
        "m"
      ],
      [
        "h",
        "a"
      ],
      [
        "an",
        "a"
      ],
      [
        "o",
        "r"
      ],
      [
        "m",
        "i"
      ],
      [
        "an",
        "ana"
      ],
      [
        "l",
        "o"
      ],
      [
        "a",
        "r"
      ],
      [
        "k",
        "o"
      ],
      [
        "mi",
        "ko"
      ],
      [
        "─á",
        "f"
      ],
      [
        "─áy",
        "u"
      ],
      [
        "─á",
        "s"
      ],
      [
        "e",
        "n"
      ],
      [
        "─áa",
        "miko"
      ],
      [
        "i",
        "n"
      ],
      [
        "M",
        "e"
      ],
      [
        "o",
        "u"
      ],
      [
        "─á",
        "n"
      ],
      [
        "r",
        "e"
      ],
      [
        "el",
        "lo"
      ],
      [
        "a",
        "y"
      ],
      [
        "o",
        "n"
      ],
      [
        "ar",
        "a"
      ],
      [
        "─á",
        "d"
      ],
      [
        "─áb",
        "anana"
      ],
      [
        "─ám",
        "e"
      ],
      [
        "─á",
        "w"
      ],
      [
        "l",
        "e"
      ],
      [
        "o",
        "k"
      ],
      [
        "─át",
        "o"
      ],
      [
        "─á",
        "c"
      ],
      [
        "r",
        "i"
      ],
      [
        "e",
        "y"
      ],
      [
        "─áy",
        "ou"
      ],
      [
        "─áp",
        "ara"
      ],
      [
        "─á",
        "ha"
      ],
      [
        "e",
        "d"
      ],
      [
        "─áf",
        "a"
      ],
      [
        "?",
        "<"
      ],
      [
        "─á",
        "Me"
      ],
      [
        "─á",
        "h"
      ],
      [
        "a",
        "t"
      ],
      [
        "v",
        "or"
      ],
      [
        "─áfa",
        "vor"
      ],
      [
        "─án",
        "o"
      ],
      [
        "ha",
        "t"
      ],
      [
        "─á",
        "k"
      ],
      [
        "?",
        ","
      ],
      [
        "in",
        "g"
      ],
      [
        "─á",
        "g"
      ],
      [
        "en",
        "d"
      ],
      [
        "m",
        "e"
      ],
      [
        "u",
        "l"
      ],
      [
        "─á",
        "B"
      ],
      [
        "e",
        "st"
      ],
      [
        "o",
        "o"
      ],
      [
        "q",
        "u"
      ],
      [
        "─á",
        "ok"
      ],
      [
        "ri",
        "end"
      ],
      [
        "a",
        "l"
      ],
      [
        "as",
        "e"
      ],
      [
        "le",
        "ase"
      ],
      [
        "─á",
        "l"
      ],
      [
        "─áb",
        "ello"
      ],
      [
        "el",
        "l"
      ],
      [
        "─ák",
        "a"
      ],
      [
        "!",
        "!"
      ],
      [
        "an",
        "k"
      ],
      [
        ".",
        "<"
      ],
      [
        "d",
        "y"
      ],
      [
        "p",
        "ay"
      ],
      [
        "u",
        "d"
      ],
      [
        "u",
        "n"
      ],
      [
        "a",
        "m"
      ],
      [
        "i",
        "c"
      ],
      [
        "p",
        "p"
      ],
      [
        "l",
        "l"
      ],
      [
        "─á",
        "T"
      ],
      [
        "─á",
        "I"
      ],
      [
        "i",
        "on"
      ],
      [
        "oo",
        "pay"
      ],
      [
        "oopay",
        "e"
      ],
      [
        "'",
        "s"
      ],
      [
        "─át",
        "hat"
      ],
      [
        "ist",
        "en"
      ],
      [
        "─ál",
        "isten"
      ],
      [
        "e",
        "e"
      ],
      [
        "─át",
        "i"
      ],
      [
        "─át",
        "u"
      ],
      [
        "i",
        "d"
      ],
      [
        "─áB",
        "anana"
      ],
      [
        "─ám",
        "y"
      ],
      [
        "r",
        "y"
      ],
      [
        "c",
        "e"
      ],
      [
        "─áha",
        "pp"
      ],
      [
        "─át",
        "ank"
      ],
      [
        "─áha",
        "ha"
      ],
      [
        "─ás",
        "a"
      ],
      [
        "─á",
        "qu"
      ],
      [
        "─áok",
        "ay"
      ],
      [
        "r",
        "a"
      ],
      [
        "t",
        "h"
      ],
      [
        "─áw",
        "ant"
      ],
      [
        "v",
        "e"
      ],
      [
        "─át",
        "ell"
      ],
      [
        "t",
        "o"
      ],
      [
        "─áf",
        "riend"
      ],
      [
        "ud",
        "dy"
      ],
      [
        "a",
        "k"
      ],
      [
        ")",
        "<"
      ],
      [
        ":",
        ")<"
      ],
      [
        "─á",
        ":)<"
      ],
      [
        "est",
        "ion"
      ],
      [
        "─áqu",
        "estion"
      ],
      [
        "─á",
        "W"
      ],
      [
        "─áp",
        "o"
      ],
      [
        "at",
        "o"
      ],
      [
        "─á",
        "st"
      ],
      [
        "─áp",
        "lease"
      ],
      [
        "─ád",
        "o"
      ],
      [
        "ic",
        "k"
      ],
      [
        "y",
        "e"
      ],
      [
        "o",
        "l"
      ],
      [
        "─á",
        "e"
      ],
      [
        "N",
        "o"
      ],
      [
        "─áb",
        "uddy"
      ],
      [
        "i",
        "lo"
      ],
      [
        "ul",
        "al"
      ],
      [
        "ilo",
        "o"
      ],
      [
        "ulal",
        "iloo"
      ],
      [
        "ol",
        "to"
      ],
      [
        "─áp",
        "or"
      ],
      [
        "d",
        "ok"
      ],
      [
        "─áok",
        "ey"
      ],
      [
        "dok",
        "ey"
      ],
      [
        "─ám",
        "olto"
      ],
      [
        "─áhapp",
        "y"
      ],
      [
        "ar",
        "t"
      ],
      [
        "─áa",
        "ll"
      ],
      [
        "─áwant",
        "ed"
      ],
      [
        "─á",
        "P"
      ],
      [
        "b",
        "ello"
      ],
      [
        "─át",
        "h"
      ],
      [
        "i",
        "s"
      ],
      [
        "h",
        "ey"
      ],
      [
        "f",
        "riend"
      ],
      [
        "e",
        "a"
      ],
      [
        "o",
        "me"
      ],
      [
        "el",
        "ato"
      ],
      [
        "qu",
        "ick"
      ],
      [
        "p",
        "lease"
      ],
      [
        "p",
        "ara"
      ],
      [
        "p",
        "o"
      ],
      [
        "o",
        "ye"
      ],
      [
        "─ád",
        "ul"
      ],
      [
        "─ása",
        "e"
      ],
      [
        "H",
        "ana"
      ],
      [
        "a",
        "miko"
      ],
      [
        "B",
        "anana"
      ],
      [
        "B",
        "ello"
      ],
      [
        "le",
        "g"
      ],
      [
        "─á",
        "j"
      ],
      [
        "─án",
        "e"
      ],
      [
        "h",
        "o"
      ],
      [
        "am",
        "os"
      ],
      [
        "or",
        "n"
      ],
      [
        "d",
        "o"
      ],
      [
        "'",
        "m"
      ],
      [
        "─áa",
        "leg"
      ],
      [
        "er",
        "o"
      ],
      [
        "─áti",
        "me"
      ],
      [
        "g",
        "e"
      ],
      [
        "ri",
        "a"
      ],
      [
        "─áb",
        "en"
      ],
      [
        "─áben",
        "e"
      ],
      [
        "p",
        "er"
      ],
      [
        "─áaleg",
        "ria"
      ],
      [
        "a",
        "st"
      ],
      [
        "ak",
        "e"
      ],
      [
        "─á",
        "re"
      ],
      [
        "─án",
        "a"
      ],
      [
        "m",
        "a"
      ],
      [
        "─áT",
        "ulaliloo"
      ],
      [
        "─á",
        "C"
      ],
      [
        "an",
        "ce"
      ],
      [
        "─áa",
        "g"
      ],
      [
        "e",
        "s"
      ],
      [
        "S",
        "i"
      ],
      [
        "─áW",
        "e"
      ],
      [
        "─áp",
        "oopaye"
      ],
      [
        "e",
        "p"
      ],
      [
        "re",
        "am"
      ],
      [
        "─ád",
        "ream"
      ],
      [
        "─ádream",
        "s"
      ],
      [
        "─ág",
        "o"
      ],
      [
        "o",
        "m"
      ],
      [
        "!",
        "!<"
      ],
      [
        "─áw",
        "e"
      ],
      [
        "─ác",
        "an"
      ],
      [
        "orn",
        "ing"
      ],
      [
        "a",
        "ha"
      ],
      [
        "aha",
        "ha"
      ],
      [
        "─áf",
        "or"
      ],
      [
        "─á",
        "in"
      ],
      [
        "i",
        "t"
      ],
      [
        "Y",
        "u"
      ],
      [
        "P",
        "oopaye"
      ],
      [
        "r",
        "o"
      ],
      [
        "a",
        "dy"
      ],
      [
        "─áto",
        "d"
      ],
      [
        "─áto",
        "o"
      ],
      [
        "ud",
        "a"
      ],
      [
        "─áh",
        "u"
      ],
      [
        "─á",
        "Hana"
      ],
      [
        "─áb",
        "on"
      ],
      [
        "c",
        "o"
      ],
      [
        "─á",
        "S"
      ],
      [
        "─á",
        "o"
      ],
      [
        "─áno",
        "w"
      ],
      [
        "─áw",
        "hat"
      ],
      [
        "─áe",
        "x"
      ],
      [
        "─ás",
        "i"
      ],
      [
        "u",
        "c"
      ],
      [
        "al",
        "l"
      ],
      [
        "id",
        "ea"
      ],
      [
        "y",
        "uda"
      ],
      [
        "─áa",
        "yuda"
      ],
      [
        "ee",
        "t"
      ]
    ]
  }
}